{"_id": "blog-seed-1", "_type": "blog", "title": "S.R. Construction Delivers Feed-in at World’s first LC-Max Residue Upgradation Facility at Visakh Refinery", "slug": { "_type": "slug", "current": "s-r-construction-delivers-feed-in-visakh" }, "publishedAt": "2026-01-05T10:00:00Z", "excerpt": "A major milestone in refining technology, S.R. Construction successfully commissions the feed-in systems for the world's first LC-Max facility, enhancing efficiency and sustainability.", "body": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "S.R. Construction is proud to announce the successful delivery of feed-in systems for the landmark LC-Max Residue Upgradation Facility. This project marks a significant step forward in heavy crude processing technology."}]}]}
{"_id": "blog-seed-2", "_type": "blog", "title": "S.R. Construction Wins Major Order for Hydrocarbon Onshore Business", "slug": { "_type": "slug", "current": "s-r-construction-wins-major-order-hydrocarbon" }, "publishedAt": "2025-12-23T10:00:00Z", "excerpt": "Securing a significant contract to expand onshore hydrocarbon infrastructure, reinforcing our leadership in the energy sector.", "body": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "We have secured a major order for the Hydrocarbon Onshore Business. The scope involves Engineering, Procurement, and Construction (EPC) for a state-of-the-art gas processing plant."}]}]}
{"_id": "blog-seed-3", "_type": "blog", "title": "S.R. Construction secures a key role in TenneT’s landmark Offshore Wind Programme", "slug": { "_type": "slug", "current": "s-r-construction-tennet-offshore-wind" }, "publishedAt": "2025-10-30T10:00:00Z", "excerpt": "Partnership with TenneT marks a strategic entry into large-scale European offshore wind energy projects.", "body": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "S.R. Construction has been selected as a key partner in TenneT's ambitious 2GW Program. This offshore wind initiative will supply green energy to millions of households across Europe."}]}]}
